GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.h
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x1EA2);
// bitfield macros
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x5
#define _CCP2PPS_CCP2PPS_LENGTH                             0x5
#define _CCP2PPS_CCP2PPS_MASK                               0x1F
#define _CCP2PPS_CCP2PPS0_POSN                              0x0
#define _CCP2PPS_CCP2PPS0_POSITION                          0x0
#define _CCP2PPS_CCP2PPS0_SIZE                              0x1
#define _CCP2PPS_CCP2PPS0_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS0_MASK                              0x1
#define _CCP2PPS_CCP2PPS1_POSN                              0x1
#define _CCP2PPS_CCP2PPS1_POSITION                          0x1
#define _CCP2PPS_CCP2PPS1_SIZE                              0x1
#define _CCP2PPS_CCP2PPS1_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS1_MASK                              0x2
#define _CCP2PPS_CCP2PPS2_POSN                              0x2
#define _CCP2PPS_CCP2PPS2_POSITION                          0x2
#define _CCP2PPS_CCP2PPS2_SIZE                              0x1
#define _CCP2PPS_CCP2PPS2_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS2_MASK                              0x4
#define _CCP2PPS_CCP2PPS3_POSN                              0x3
#define _CCP2PPS_CCP2PPS3_POSITION                          0x3
#define _CCP2PPS_CCP2PPS3_SIZE                              0x1
#define _CCP2PPS_CCP2PPS3_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS3_MASK                              0x8
#define _CCP2PPS_CCP2PPS4_POSN                              0x4
#define _CCP2PPS_CCP2PPS4_POSITION                          0x4
#define _CCP2PPS_CCP2PPS4_SIZE                              0x1
#define _CCP2PPS_CCP2PPS4_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS4_MASK                              0x10

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
extern volatile unsigned char           SMT1WINPPS          __at(0x1EA9);
#ifndef _LIB_BUILD
asm("SMT1WINPPS equ 01EA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1WINPPS             :5;
    };
    struct {
        unsigned SMU1WINPPS0            :1;
        unsigned SMU1WINPPS1            :1;
        unsigned SMU1WINPPS2            :1;
        unsigned SMU1WINPPS3            :1;
        unsigned SMU1WINPPS4            :1;
    };
} SMT1WINPPSbits_t;
extern volatile SMT1WINPPSbits_t SMT1WINPPSbits __at(0x1EA9);
// bitfield macros
#define _SMT1WINPPS_SMT1WINPPS_POSN                         0x0
#define _SMT1WINPPS_SMT1WINPPS_POSITION                     0x0
#define _SMT1WINPPS_SMT1WINPPS_SIZE                         0x5
#define _SMT1WINPPS_SMT1WINPPS_LENGTH                       0x5
#define _SMT1WINPPS_SMT1WINPPS_MASK                         0x1F
#define _SMT1WINPPS_SMU1WINPPS0_POSN                        0x0
#define _SMT1WINPPS_SMU1WINPPS0_POSITION                    0x0
#define _SMT1WINPPS_SMU1WINPPS0_SIZE                        0x1
#define _SMT1WINPPS_SMU1WINPPS0_LENGTH                      0x1
#define _SMT1WINPPS_SMU1WINPPS0_MASK                        0x1
#define _SMT1WINPPS_SMU1WINPPS1_POSN                        0x1
#define _SMT1WINPPS_SMU1WINPPS1_POSITION                    0x1
#define _SMT1WINPPS_SMU1WINPPS1_SIZE                        0x1
#define _SMT1WINPPS_SMU1WINPPS1_LENGTH                      0x1
#define _SMT1WINPPS_SMU1WINPPS1_MASK                        0x2
#define _SMT1WINPPS_SMU1WINPPS2_POSN                        0x2
#define _SMT1WINPPS_SMU1WINPPS2_POSITION                    0x2
#define _SMT1WINPPS_SMU1WINPPS2_SIZE                        0x1
#define _SMT1WINPPS_SMU1WINPPS2_LENGTH                      0x1
#define _SMT1WINPPS_SMU1WINPPS2_MASK                        0x4
#define _SMT1WINPPS_SMU1WINPPS3_POSN                        0x3
#define _SMT1WINPPS_SMU1WINPPS3_POSITION                    0x3
#define _SMT1WINPPS_SMU1WINPPS3_SIZE                        0x1
#define _SMT1WINPPS_SMU1WINPPS3_LENGTH                      0x1
#define _SMT1WINPPS_SMU1WINPPS3_MASK                        0x8
#define _SMT1WINPPS_SMU1WINPPS4_POSN                        0x4
#define _SMT1WINPPS_SMU1WINPPS4_POSITION                    0x4
#define _SMT1WINPPS_SMU1WINPPS4_SIZE                        0x1
#define _SMT1WINPPS_SMU1WINPPS4_LENGTH                      0x1
#define _SMT1WINPPS_SMU1WINPPS4_MASK                        0x10

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
extern volatile unsigned char           SMT1SIGPPS          __at(0x1EAA);
#ifndef _LIB_BUILD
asm("SMT1SIGPPS equ 01EAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1SIGPPS             :5;
    };
    struct {
        unsigned SMU1SIGPPS0            :1;
        unsigned SMU1SIGPPS1            :1;
        unsigned SMU1SIGPPS2            :1;
        unsigned SMU1SIGPPS3            :1;
        unsigned SMU1SIGPPS4            :1;
    };
} SMT1SIGPPSbits_t;
extern volatile SMT1SIGPPSbits_t SMT1SIGPPSbits __at(0x1EAA);
// bitfield macros
#define _SMT1SIGPPS_SMT1SIGPPS_POSN                         0x0
#define _SMT1SIGPPS_SMT1SIGPPS_POSITION                     0x0
#define _SMT1SIGPPS_SMT1SIGPPS_SIZE                         0x5
#define _SMT1SIGPPS_SMT1SIGPPS_LENGTH                       0x5
#define _SMT1SIGPPS_SMT1SIGPPS_MASK                         0x1F
#define _SMT1SIGPPS_SMU1SIGPPS0_POSN                        0x0
#define _SMT1SIGPPS_SMU1SIGPPS0_POSITION                    0x0
#define _SMT1SIGPPS_SMU1SIGPPS0_SIZE                        0x1
#define _SMT1SIGPPS_SMU1SIGPPS0_LENGTH                      0x1
#define _SMT1SIGPPS_SMU1SIGPPS0_MASK                        0x1
#define _SMT1SIGPPS_SMU1SIGPPS1_POSN                        0x1
#define _SMT1SIGPPS_SMU1SIGPPS1_POSITION                    0x1
#define _SMT1SIGPPS_SMU1SIGPPS1_SIZE                        0x1
#define _SMT1SIGPPS_SMU1SIGPPS1_LENGTH                      0x1
#define _SMT1SIGPPS_SMU1SIGPPS1_MASK                        0x2
#define _SMT1SIGPPS_SMU1SIGPPS2_POSN                        0x2
#define _SMT1SIGPPS_SMU1SIGPPS2_POSITION                    0x2
#define _SMT1SIGPPS_SMU1SIGPPS2_SIZE                        0x1
#define _SMT1SIGPPS_SMU1SIGPPS2_LENGTH                      0x1
#define _SMT1SIGPPS_SMU1SIGPPS2_MASK                        0x4
#define _SMT1SIGPPS_SMU1SIGPPS3_POSN                        0x3
#define _SMT1SIGPPS_SMU1SIGPPS3_POSITION                    0x3
#define _SMT1SIGPPS_SMU1SIGPPS3_SIZE                        0x1
#define _SMT1SIGPPS_SMU1SIGPPS3_LENGTH                      0x1
#define _SMT1SIGPPS_SMU1SIGPPS3_MASK                        0x8
#define _SMT1SIGPPS_SMU1SIGPPS4_POSN                        0x4
#define _SMT1SIGPPS_SMU1SIGPPS4_POSITION                    0x4
#define _SMT1SIGPPS_SMU1SIGPPS4_SIZE                        0x1
#define _SMT1SIGPPS_SMU1SIGPPS4_LENGTH                      0x1
#define _SMT1SIGPPS_SMU1SIGPPS4_MASK                        0x10

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
extern volatile unsigned char           CWG1PPS             __at(0x1EB1);
#ifndef _LIB_BUILD
asm("CWG1PPS equ 01EB1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1PPS                :5;
    };
    struct {
        unsigned CWG1PPS0               :1;
        unsigned CWG1PPS1               :1;
        unsigned CWG1PPS2               :1;
        unsigned CWG1PPS3               :1;
        unsigned CWG1PPS4               :1;
    };
} CWG1PPSbits_t;
extern volatile CWG1PPSbits_t CWG1PPSbits __at(0x1EB1);
// bitfield macros
#define _CWG1PPS_CWG1PPS_POSN                               0x0
#define _CWG1PPS_CWG1PPS_POSITION                           0x0
#define _CWG1PPS_CWG1PPS_SIZE                               0x5
#define _CWG1PPS_CWG1PPS_LENGTH                             0x5
#define _CWG1PPS_CWG1PPS_MASK                               0x1F
#define _CWG1PPS_CWG1PPS0_POSN                              0x0
#define _CWG1PPS_CWG1PPS0_POSITION                          0x0
#define _CWG1PPS_CWG1PPS0_SIZE                              0x1
#define _CWG1PPS_CWG1PPS0_LENGTH                            0x1
#define _CWG1PPS_CWG1PPS0_MASK                              0x1
#define _CWG1PPS_CWG1PPS1_POSN                              0x1
#define _CWG1PPS_CWG1PPS1_POSITION                          0x1
#define _CWG1PPS_CWG1PPS1_SIZE                              0x1
#define _CWG1PPS_CWG1PPS1_LENGTH                            0x1
#define _CWG1PPS_CWG1PPS1_MASK                              0x2
#define _CWG1PPS_CWG1PPS2_POSN                              0x2
#define _CWG1PPS_CWG1PPS2_POSITION                          0x2
#define _CWG1PPS_CWG1PPS2_SIZE                              0x1
#define _CWG1PPS_CWG1PPS2_LENGTH                            0x1
#define _CWG1PPS_CWG1PPS2_MASK                              0x4
#define _CWG1PPS_CWG1PPS3_POSN                              0x3
#define _CWG1PPS_CWG1PPS3_POSITION                          0x3
#define _CWG1PPS_CWG1PPS3_SIZE                              0x1
#define _CWG1PPS_CWG1PPS3_LENGTH                            0x1
#define _CWG1PPS_CWG1PPS3_MASK                              0x8
#define _CWG1PPS_CWG1PPS4_POSN                              0x4
#define _CWG1PPS_CWG1PPS4_POSITION                          0x4
#define _CWG1PPS_CWG1PPS4_SIZE                              0x1
#define _CWG1PPS_CWG1PPS4_LENGTH                            0x1
#define _CWG1PPS_CWG1PPS4_MASK                              0x10

