GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.h
extern volatile TX2PPSbits_t TX2PPSbits __at(0x1ECE);
// bitfield macros
#define _TX2PPS_TX2PPS_POSN                                 0x0
#define _TX2PPS_TX2PPS_POSITION                             0x0
#define _TX2PPS_TX2PPS_SIZE                                 0x5
#define _TX2PPS_TX2PPS_LENGTH                               0x5
#define _TX2PPS_TX2PPS_MASK                                 0x1F
#define _TX2PPS_TX2PPS0_POSN                                0x0
#define _TX2PPS_TX2PPS0_POSITION                            0x0
#define _TX2PPS_TX2PPS0_SIZE                                0x1
#define _TX2PPS_TX2PPS0_LENGTH                              0x1
#define _TX2PPS_TX2PPS0_MASK                                0x1
#define _TX2PPS_TX2PPS1_POSN                                0x1
#define _TX2PPS_TX2PPS1_POSITION                            0x1
#define _TX2PPS_TX2PPS1_SIZE                                0x1
#define _TX2PPS_TX2PPS1_LENGTH                              0x1
#define _TX2PPS_TX2PPS1_MASK                                0x2
#define _TX2PPS_TX2PPS2_POSN                                0x2
#define _TX2PPS_TX2PPS2_POSITION                            0x2
#define _TX2PPS_TX2PPS2_SIZE                                0x1
#define _TX2PPS_TX2PPS2_LENGTH                              0x1
#define _TX2PPS_TX2PPS2_MASK                                0x4
#define _TX2PPS_TX2PPS3_POSN                                0x3
#define _TX2PPS_TX2PPS3_POSITION                            0x3
#define _TX2PPS_TX2PPS3_SIZE                                0x1
#define _TX2PPS_TX2PPS3_LENGTH                              0x1
#define _TX2PPS_TX2PPS3_MASK                                0x8
#define _TX2PPS_TX2PPS4_POSN                                0x4
#define _TX2PPS_TX2PPS4_POSITION                            0x4
#define _TX2PPS_TX2PPS4_SIZE                                0x1
#define _TX2PPS_TX2PPS4_LENGTH                              0x1
#define _TX2PPS_TX2PPS4_MASK                                0x10

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x1F10);
#ifndef _LIB_BUILD
asm("RA0PPS equ 01F10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS                 :5;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0x1F10);
// bitfield macros
#define _RA0PPS_RA0PPS_POSN                                 0x0
#define _RA0PPS_RA0PPS_POSITION                             0x0
#define _RA0PPS_RA0PPS_SIZE                                 0x5
#define _RA0PPS_RA0PPS_LENGTH                               0x5
#define _RA0PPS_RA0PPS_MASK                                 0x1F

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0x1F11);
#ifndef _LIB_BUILD
asm("RA1PPS equ 01F11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS                 :5;
    };
} RA1PPSbits_t;
extern volatile RA1PPSbits_t RA1PPSbits __at(0x1F11);
// bitfield macros
#define _RA1PPS_RA1PPS_POSN                                 0x0
#define _RA1PPS_RA1PPS_POSITION                             0x0
#define _RA1PPS_RA1PPS_SIZE                                 0x5
#define _RA1PPS_RA1PPS_LENGTH                               0x5
#define _RA1PPS_RA1PPS_MASK                                 0x1F

// Register: RA2PPS
#define RA2PPS RA2PPS
extern volatile unsigned char           RA2PPS              __at(0x1F12);
#ifndef _LIB_BUILD
asm("RA2PPS equ 01F12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA2PPS                 :5;
    };
} RA2PPSbits_t;
extern volatile RA2PPSbits_t RA2PPSbits __at(0x1F12);
// bitfield macros
#define _RA2PPS_RA2PPS_POSN                                 0x0
#define _RA2PPS_RA2PPS_POSITION                             0x0
#define _RA2PPS_RA2PPS_SIZE                                 0x5
#define _RA2PPS_RA2PPS_LENGTH                               0x5
#define _RA2PPS_RA2PPS_MASK                                 0x1F

// Register: RA3PPS
#define RA3PPS RA3PPS
extern volatile unsigned char           RA3PPS              __at(0x1F13);
#ifndef _LIB_BUILD
asm("RA3PPS equ 01F13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA3PPS                 :5;
    };
} RA3PPSbits_t;
extern volatile RA3PPSbits_t RA3PPSbits __at(0x1F13);
// bitfield macros
#define _RA3PPS_RA3PPS_POSN                                 0x0
#define _RA3PPS_RA3PPS_POSITION                             0x0
#define _RA3PPS_RA3PPS_SIZE                                 0x5
#define _RA3PPS_RA3PPS_LENGTH                               0x5
#define _RA3PPS_RA3PPS_MASK                                 0x1F

// Register: RA4PPS
#define RA4PPS RA4PPS
extern volatile unsigned char           RA4PPS              __at(0x1F14);
#ifndef _LIB_BUILD
asm("RA4PPS equ 01F14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA4PPS                 :5;
    };
} RA4PPSbits_t;
extern volatile RA4PPSbits_t RA4PPSbits __at(0x1F14);
// bitfield macros
#define _RA4PPS_RA4PPS_POSN                                 0x0
#define _RA4PPS_RA4PPS_POSITION                             0x0
#define _RA4PPS_RA4PPS_SIZE                                 0x5
#define _RA4PPS_RA4PPS_LENGTH                               0x5
#define _RA4PPS_RA4PPS_MASK                                 0x1F

// Register: RA5PPS
#define RA5PPS RA5PPS
extern volatile unsigned char           RA5PPS              __at(0x1F15);
#ifndef _LIB_BUILD
asm("RA5PPS equ 01F15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA5PPS                 :5;
    };
} RA5PPSbits_t;
extern volatile RA5PPSbits_t RA5PPSbits __at(0x1F15);
// bitfield macros
#define _RA5PPS_RA5PPS_POSN                                 0x0
#define _RA5PPS_RA5PPS_POSITION                             0x0
#define _RA5PPS_RA5PPS_SIZE                                 0x5
#define _RA5PPS_RA5PPS_LENGTH                               0x5
#define _RA5PPS_RA5PPS_MASK                                 0x1F

// Register: RA6PPS
#define RA6PPS RA6PPS
extern volatile unsigned char           RA6PPS              __at(0x1F16);
#ifndef _LIB_BUILD
asm("RA6PPS equ 01F16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA6PPS                 :5;
    };
} RA6PPSbits_t;
extern volatile RA6PPSbits_t RA6PPSbits __at(0x1F16);
// bitfield macros
#define _RA6PPS_RA6PPS_POSN                                 0x0
#define _RA6PPS_RA6PPS_POSITION                             0x0
#define _RA6PPS_RA6PPS_SIZE                                 0x5
#define _RA6PPS_RA6PPS_LENGTH                               0x5
#define _RA6PPS_RA6PPS_MASK                                 0x1F

// Register: RA7PPS
#define RA7PPS RA7PPS
extern volatile unsigned char           RA7PPS              __at(0x1F17);
#ifndef _LIB_BUILD
asm("RA7PPS equ 01F17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA7PPS                 :5;
    };
} RA7PPSbits_t;
extern volatile RA7PPSbits_t RA7PPSbits __at(0x1F17);
// bitfield macros
#define _RA7PPS_RA7PPS_POSN                                 0x0
#define _RA7PPS_RA7PPS_POSITION                             0x0
#define _RA7PPS_RA7PPS_SIZE                                 0x5
#define _RA7PPS_RA7PPS_LENGTH                               0x5
#define _RA7PPS_RA7PPS_MASK                                 0x1F

// Register: RB0PPS
#define RB0PPS RB0PPS
extern volatile unsigned char           RB0PPS              __at(0x1F18);
#ifndef _LIB_BUILD
asm("RB0PPS equ 01F18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0PPS                 :5;
    };
} RB0PPSbits_t;
extern volatile RB0PPSbits_t RB0PPSbits __at(0x1F18);
// bitfield macros
#define _RB0PPS_RB0PPS_POSN                                 0x0
#define _RB0PPS_RB0PPS_POSITION                             0x0
#define _RB0PPS_RB0PPS_SIZE                                 0x5
#define _RB0PPS_RB0PPS_LENGTH                               0x5
#define _RB0PPS_RB0PPS_MASK                                 0x1F

// Register: RB1PPS
#define RB1PPS RB1PPS
extern volatile unsigned char           RB1PPS              __at(0x1F19);
#ifndef _LIB_BUILD
asm("RB1PPS equ 01F19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB1PPS                 :5;
    };
} RB1PPSbits_t;
