GopalSaraf/Practicals/PSDL/include/proc/pic16f19175.h
// Register: RC3PPS
#define RC3PPS RC3PPS
extern volatile unsigned char           RC3PPS              __at(0x1F23);
#ifndef _LIB_BUILD
asm("RC3PPS equ 01F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC3PPS                 :5;
    };
} RC3PPSbits_t;
extern volatile RC3PPSbits_t RC3PPSbits __at(0x1F23);
// bitfield macros
#define _RC3PPS_RC3PPS_POSN                                 0x0
#define _RC3PPS_RC3PPS_POSITION                             0x0
#define _RC3PPS_RC3PPS_SIZE                                 0x5
#define _RC3PPS_RC3PPS_LENGTH                               0x5
#define _RC3PPS_RC3PPS_MASK                                 0x1F

// Register: RC4PPS
#define RC4PPS RC4PPS
extern volatile unsigned char           RC4PPS              __at(0x1F24);
#ifndef _LIB_BUILD
asm("RC4PPS equ 01F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC4PPS                 :5;
    };
} RC4PPSbits_t;
extern volatile RC4PPSbits_t RC4PPSbits __at(0x1F24);
// bitfield macros
#define _RC4PPS_RC4PPS_POSN                                 0x0
#define _RC4PPS_RC4PPS_POSITION                             0x0
#define _RC4PPS_RC4PPS_SIZE                                 0x5
#define _RC4PPS_RC4PPS_LENGTH                               0x5
#define _RC4PPS_RC4PPS_MASK                                 0x1F

// Register: RC6PPS
#define RC6PPS RC6PPS
extern volatile unsigned char           RC6PPS              __at(0x1F26);
#ifndef _LIB_BUILD
asm("RC6PPS equ 01F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC6PPS                 :5;
    };
} RC6PPSbits_t;
extern volatile RC6PPSbits_t RC6PPSbits __at(0x1F26);
// bitfield macros
#define _RC6PPS_RC6PPS_POSN                                 0x0
#define _RC6PPS_RC6PPS_POSITION                             0x0
#define _RC6PPS_RC6PPS_SIZE                                 0x5
#define _RC6PPS_RC6PPS_LENGTH                               0x5
#define _RC6PPS_RC6PPS_MASK                                 0x1F

// Register: RC7PPS
#define RC7PPS RC7PPS
extern volatile unsigned char           RC7PPS              __at(0x1F27);
#ifndef _LIB_BUILD
asm("RC7PPS equ 01F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC7PPS                 :5;
    };
} RC7PPSbits_t;
extern volatile RC7PPSbits_t RC7PPSbits __at(0x1F27);
// bitfield macros
#define _RC7PPS_RC7PPS_POSN                                 0x0
#define _RC7PPS_RC7PPS_POSITION                             0x0
#define _RC7PPS_RC7PPS_SIZE                                 0x5
#define _RC7PPS_RC7PPS_LENGTH                               0x5
#define _RC7PPS_RC7PPS_MASK                                 0x1F

// Register: RD0PPS
#define RD0PPS RD0PPS
extern volatile unsigned char           RD0PPS              __at(0x1F28);
#ifndef _LIB_BUILD
asm("RD0PPS equ 01F28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0PPS                 :5;
    };
} RD0PPSbits_t;
extern volatile RD0PPSbits_t RD0PPSbits __at(0x1F28);
// bitfield macros
#define _RD0PPS_RD0PPS_POSN                                 0x0
#define _RD0PPS_RD0PPS_POSITION                             0x0
#define _RD0PPS_RD0PPS_SIZE                                 0x5
#define _RD0PPS_RD0PPS_LENGTH                               0x5
#define _RD0PPS_RD0PPS_MASK                                 0x1F

// Register: RD1PPS
#define RD1PPS RD1PPS
extern volatile unsigned char           RD1PPS              __at(0x1F29);
#ifndef _LIB_BUILD
asm("RD1PPS equ 01F29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD1PPS                 :5;
    };
} RD1PPSbits_t;
extern volatile RD1PPSbits_t RD1PPSbits __at(0x1F29);
// bitfield macros
#define _RD1PPS_RD1PPS_POSN                                 0x0
#define _RD1PPS_RD1PPS_POSITION                             0x0
#define _RD1PPS_RD1PPS_SIZE                                 0x5
#define _RD1PPS_RD1PPS_LENGTH                               0x5
#define _RD1PPS_RD1PPS_MASK                                 0x1F

// Register: RD2PPS
#define RD2PPS RD2PPS
extern volatile unsigned char           RD2PPS              __at(0x1F2A);
#ifndef _LIB_BUILD
asm("RD2PPS equ 01F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD2PPS                 :5;
    };
} RD2PPSbits_t;
extern volatile RD2PPSbits_t RD2PPSbits __at(0x1F2A);
// bitfield macros
#define _RD2PPS_RD2PPS_POSN                                 0x0
#define _RD2PPS_RD2PPS_POSITION                             0x0
#define _RD2PPS_RD2PPS_SIZE                                 0x5
#define _RD2PPS_RD2PPS_LENGTH                               0x5
#define _RD2PPS_RD2PPS_MASK                                 0x1F

// Register: RD3PPS
#define RD3PPS RD3PPS
extern volatile unsigned char           RD3PPS              __at(0x1F2B);
#ifndef _LIB_BUILD
asm("RD3PPS equ 01F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD3PPS                 :5;
    };
} RD3PPSbits_t;
extern volatile RD3PPSbits_t RD3PPSbits __at(0x1F2B);
// bitfield macros
#define _RD3PPS_RD3PPS_POSN                                 0x0
#define _RD3PPS_RD3PPS_POSITION                             0x0
#define _RD3PPS_RD3PPS_SIZE                                 0x5
#define _RD3PPS_RD3PPS_LENGTH                               0x5
#define _RD3PPS_RD3PPS_MASK                                 0x1F

// Register: RD4PPS
#define RD4PPS RD4PPS
extern volatile unsigned char           RD4PPS              __at(0x1F2C);
#ifndef _LIB_BUILD
asm("RD4PPS equ 01F2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD4PPS                 :5;
    };
} RD4PPSbits_t;
extern volatile RD4PPSbits_t RD4PPSbits __at(0x1F2C);
// bitfield macros
#define _RD4PPS_RD4PPS_POSN                                 0x0
#define _RD4PPS_RD4PPS_POSITION                             0x0
#define _RD4PPS_RD4PPS_SIZE                                 0x5
#define _RD4PPS_RD4PPS_LENGTH                               0x5
#define _RD4PPS_RD4PPS_MASK                                 0x1F

